package ru.derendyaev.mospolytech.bot;

public final class BotConstant {

    public static final String INTRO_MESSAGE = """
            Привет! 👋 Я бот, который поможет вам выбрать тему для дипломной работы!
                        
            Как это работает:
                        
            - Я буду задавать вам несколько вопросов о ваших навыках и интересах.
            - На основе ваших ответов, я предложу вам несколько подходящих тем для диплома.
            
            Чтобы начать, просто продолжите отвечать на мои сообщения, и мы продолжим наш диалог. Не стесняйтесь описывать свои компетенции и область интересов — я подберу для вас лучшие варианты!
                        
            Готовы? Начнём прямо сейчас! 🚀
            """;

    public static final String ASK_COMPETENCIES_MESSAGE = """
            Введите через пробел области применения научной работы или напишите тему целиком
            Пример:
            - Здоровье и медицина
            ИЛИ
            - Блокчейн и банковское дело
            """;
}
